Tekla Open API Reference for Tekla Structures 2025
Reinforcement.GetRebarGeometries Method
Overload List
Name | Description
GetRebarGeometries(Boolean)
 Retrieves a list of physical reinforcing bars (of type RebarGeometry). These objects contain physical points in the 3D space of each reinforcing bar.
GetRebarGeometries(Reinforcement.RebarGeometryOptionEnum)
 Retrieves a list of physical reinforcing bars (of type RebarGeometry). These objects contain physical points in the 3D space of each reinforcing bar.
Top
See Also
Reference
Reinforcement Class
Tekla.Structures.Model Namespace